Revit 2027 API
Category.Id Property
 Returns the category id associated with the category object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Id { get; }
Public ReadOnly Property Id As ElementId
	Get
public:
property ElementId^ Id {
	ElementId^ get ();
}
member Id : ElementId with get
Property Value
ElementId
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace